OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/heatTransfer/chtMultiRegionFoam/windshieldCondensation/0.orig/windshield/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 260;

boundaryField
{
    symmetry
    {
        type            symmetryPlane;
    }

    walls
    {
        type            zeroGradient;
    }

    windshield_to_cabin
    {
        type            humidityTemperatureCoupledMixed;
        kappaMethod     solidThermo;
        kappa           none;
        value           uniform 260;
    }

    exterior
    {
        type            externalWallHeatFluxTemperature;
        mode            coefficient;
        h               uniform 10;
        Ta              uniform 260;
        kappaMethod     solidThermo;
        kappa           none;
        value           uniform 260;
    }
}


// ************************************************************************* //
